performance/reports/archive/runs/reactions-2026-08-05T08-54-08/summary.txt
     ✗ login 200
      ↳  83% — ✓ 100 / ✗ 20
     ✓ post reaction 2xx

     auth_failures..................: 20     0.213196/s
   ✗ checks.........................: 90.90% ✓ 200      ✗ 20  
     data_received..................: 180 kB 1.9 kB/s
     data_sent......................: 66 kB  707 B/s
     http_req_blocked...............: avg=141.68µs min=0s       med=0s    max=1.49ms  p(90)=999.8µs  p(95)=999.8µs p(99)=1.04ms  
     http_req_connecting............: avg=92.45µs  min=0s       med=0s    max=1.04ms  p(90)=495.73µs p(95)=999.8µs p(99)=1.04ms  
     http_req_duration..............: avg=7.19s    min=22.76ms  med=2.56s max=30.31s  p(90)=26.53s   p(95)=30.21s  p(99)=30.31s  
       { expected_response:true }...: avg=4.88s    min=22.76ms  med=2.35s max=29.48s  p(90)=12.05s   p(95)=24.22s  p(99)=26.43s  
     ✓ { feature:auth }.............: avg=10.3s    min=135.06ms med=2.31s max=30.31s  p(90)=30.21s   p(95)=30.3s   p(99)=30.31s  
     ✓ { feature:board }............: avg=0s       min=0s       med=0s    max=0s      p(90)=0s       p(95)=0s      p(99)=0s      
     ✓ { feature:chat }.............: avg=0s       min=0s       med=0s    max=0s      p(90)=0s       p(95)=0s      p(99)=0s      
     ✓ { feature:comment }..........: avg=0s       min=0s       med=0s    max=0s      p(90)=0s       p(95)=0s      p(99)=0s      
     ✓ { feature:friend }...........: avg=0s       min=0s       med=0s    max=0s      p(90)=0s       p(95)=0s      p(99)=0s      
     ✓ { feature:hot }..............: avg=0s       min=0s       med=0s    max=0s      p(90)=0s       p(95)=0s      p(99)=0s      
     ✓ { feature:mypage }...........: avg=0s       min=0s       med=0s    max=0s      p(90)=0s       p(95)=0s      p(99)=0s      
     ✓ { feature:notification }.....: avg=0s       min=0s       med=0s    max=0s      p(90)=0s       p(95)=0s      p(99)=0s      
     ✓ { feature:post }.............: avg=0s       min=0s       med=0s    max=0s      p(90)=0s       p(95)=0s      p(99)=0s      
     ✓ { feature:reaction }.........: avg=3.45s    min=22.76ms  med=3.21s max=10.96s  p(90)=7.89s    p(95)=8.48s   p(99)=10.33s  
     ✓ { feature:school }...........: avg=0s       min=0s       med=0s    max=0s      p(90)=0s       p(95)=0s      p(99)=0s      
     ✓ { feature:scrap }............: avg=0s       min=0s       med=0s    max=0s      p(90)=0s       p(95)=0s      p(99)=0s      
     ✓ { feature:timetable }........: avg=0s       min=0s       med=0s    max=0s      p(90)=0s       p(95)=0s      p(99)=0s      
     ✗ { name:post_reaction }.......: avg=3.45s    min=22.76ms  med=3.21s max=10.96s  p(90)=7.89s    p(95)=8.48s   p(99)=10.33s  
     ✓ { op:read }..................: avg=0s       min=0s       med=0s    max=0s      p(90)=0s       p(95)=0s      p(99)=0s      
     ✗ { op:write }.................: avg=7.19s    min=22.76ms  med=2.56s max=30.31s  p(90)=26.53s   p(95)=30.21s  p(99)=30.31s  
   ✗ http_req_failed................: 9.09%  ✓ 20       ✗ 200 
     http_req_receiving.............: avg=1.03ms   min=0s       med=0s    max=94.67ms p(90)=622.47µs p(95)=1.14ms  p(99)=6.47ms  
     http_req_sending...............: avg=10.1µs   min=0s       med=0s    max=639µs   p(90)=0s       p(95)=0s      p(99)=531.25µs
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s    max=0s      p(90)=0s       p(95)=0s      p(99)=0s      
     http_req_waiting...............: avg=7.18s    min=22.22ms  med=2.56s max=30.31s  p(90)=26.53s   p(95)=30.21s  p(99)=30.31s  
     http_reqs......................: 220    2.345156/s
     iteration_duration.............: avg=15.31s   min=2.09s    med=8.7s  max=37.8s   p(90)=33.91s   p(95)=36.21s  p(99)=37.69s  
     iterations.....................: 120    1.279176/s
     vus............................: 1      min=1      max=20
     vus_max........................: 20     min=20     max=20